# InitialIlluminanceIntensity Constructor (InitialIlluminanceIntensity) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
InitialIlluminanceIntensity Constructor (InitialIlluminanceIntensity)
InitialIlluminanceIntensity Class See Also
---
Creates a copy of the given initial illuminance intensity object
**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public InitialIlluminanceIntensity(
	InitialIlluminanceIntensity other
)
```

Visual Basic
---
```text
Public Sub New ( _
	other As InitialIlluminanceIntensity _
)
```

Visual C++
---
```text
public:
InitialIlluminanceIntensity(
	InitialIlluminanceIntensity^ other
)
```

# ### Parameters
other
    Type: Autodesk.Revit.DB.Lighting..::..InitialIlluminanceIntensity
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
InitialIlluminanceIntensity Class
InitialIlluminanceIntensity Overload
Autodesk.Revit.DB.Lighting Namespace